{
    "boolean_expressions": ["Evaluate the result of a random Boolean expression.", "You will be provided boolean expressions similar to the ones below", "Now, evaluate the result of this boolean expression"],
    "causal_judgement": ["Answer questions about causal attribution.", "You will be provided questions about causal attribution similar to the ones below", "Now, answer the question below"],
    "date_understanding": ["Infer the date from context.", "You will be provided contexts similar to the ones below", "Now, answer the question below"],
    "disambiguation_qa": ["Clarify the meaning of sentences with ambiguous pronouns.", "You will be provided sentences with ambigiuous pronounss similar to the ones below:", "Now, clarify the meaning of sentences with ambiguous pronouns"],
    "formal_fallacies": ["Distinguish deductively valid arguments from formal fallacies.", "You will be provided passages similar to the ones below", "Now, distinguish deductively valid arguments from formal fallacies."],
    "geometric_shapes": ["Name geometric shapes from their SVG paths.", "You will be provided SVG paths similar to the ones below", "Now, name geometric shapes from this SVG path"],
    "hyperbaton": ["Order adjectives correctly in English sentences.", "You will be provided questions similar to the ones below", "Now, answer the question below"],
    "logical_deduction_five_objects": ["A logical deduction task which requires deducing the order of a sequence of objects.", "You will be provided a sequence of objects similar to the ones below", "Now, select the right option"],
    "logical_deduction_seven_objects": ["A logical deduction task which requires deducing the order of a sequence of objects.", "You will be provided a sequence of objects similar to the ones below", "Now, select the right option"],

    "logical_deduction_three_objects": ["A logical deduction task which requires deducing the order of a sequence of objects.", "You will be provided questions similar to the ones below", "Now, answer the following question"],

    "movie_recommendation": ["Recommend movies similar to the given list of movies.", "You will be provided lists of movies similar to the ones below", "Now, recommend movies similar to this list of movies"],
    "navigate": ["Given a series of navigation instructions, determine whether one would end up back at the starting point.", "You will be provided a series of navigation instructions similar to the ones below", "Now, determine whether one would end up back at the starting point from this series of navigation instructions"],
    "penguins_in_a_table": ["Answer questions about a table of penguins and their attributes.", "You will be provided questions similar to the ones below", "Now, answer this question about a table of penguins and their attributes"],
    "reasoning_about_colored_objects": ["Answer extremely simple questions about the colors of objects on a surface.", "You will be provided questions similar to the ones below", "Now, answer the following question"],
    "ruin_names": ["Select the humorous edit that 'ruins' the input movie or musical artist name.", "You will be provided questions similar to the ones below", "Now, answer the question below"],
    "salient_translation_error_detection": ["Detect the type of error in an English translation of a German source sentence.", "You will be provided English translation of a German source sentence similar to the ones below", "Now, detect the type of error in an English translation of the following German source sentence"],
    "snarks": ["Determine which of two sentences is sarcastic.", "You will be provided two sentences similar to the ones below", "Now, determine which of two sentences is sarcastic"],
    "sports_understanding": ["Determine whether an artificially constructed sentence relating to sports is plausible or not.", "You will be provided questions similar to the following", "Now, answer the question below"],
    "temporal_sequences": ["Answer questions about which times certain events could have occurred.", "You will be provided questions about which times certain events could have occurred similar to the ones below", "Now, answer the following question"],
    "tracking_shuffled_objects_five_objects": ["A task requiring determining the final positions of a set of objects given their initial positions and a description of a sequence of swaps.", "You will be provided a set of objects given their initial positions and a description of a sequence of swaps to determining the final positions, such as the following", "Now, determine the final positions of the following object given its initial positions and a description of a sequence of swaps."],
    "tracking_shuffled_objects_seven_objects": ["A task requiring determining the final positions of a set of objects given their initial positions and a description of a sequence of swaps.", "You will be provided a set of objects given their initial positions and a description of a sequence of swaps to determining the final positions, such as the following", "Now, determine the final positions of the following object given its initial positions and a description of a sequence of swaps."],
    "tracking_shuffled_objects_three_objects": ["A task requiring determining the final positions of a set of objects given their initial positions and a description of a sequence of swaps.", "You will be provided a set of objects given their initial positions and a description of a sequence of swaps to determining the final positions, such as the following", "Now, determine the final positions of the following object given its initial positions and a description of a sequence of swaps."],    
    "web_of_lies": ["Evaluate a random boolean function expressed as a word problem with.", "You will be provided a boolean function expressed as a word problem similar to the ones below", "Now, evaluate this boolean function"]

}